[
  {
    "name": "Artirilmis Gerçeklik Teknolojisine Sahip Bir Web Sitesi ",
    "description": "Kullanıcıların sadece akıllı telefonlarını kullanarak, bir firmanın ürünlerini gerçek ortamda 3 boyutlu inceleyebilecekleri web sitesi. Üçüncü parti uygulamalara gerek yoktur. WebXR, Three.js, Javascript, Bootstrap, Scss, Html ile geliştirildi.",
    "gitLink": "https://github.com/cemozr/Augmented-reality-web-project",
    "appLink": "/",
    "imageSrc": "",
    "usedSkills": [
      "WebXR",
      "Three.js",
      "Javascript",
      "Bootstrap",
      "Scss",
      "Html"
    ]
  },
  {
    "name": "Quiz Uygulaması",
    "description": "Oyuncuların belirli bir süre içinde soruları cevaplaması veya atlaması gereken bir sınav uygulaması. On sorudan sonra uygulama oyuncunun puanını hesaplar ve gösterir. Tüm sorular Trivia Api tarafından sağlanmaktadır, böylece her sınav yeni sorular içerir. React, Fetch Api, Javascript Css ve Html ile geliştirildi.",
    "gitLink": "https://github.com/cemozr/react-quiz-app",
    "appLink": "",
    "imageSrc": "",
    "usedSkills": ["React", "Fetch Api", "Javascript", "Css", "Html"]
  },
  {
    "name": "Wordle Klonu (Türkçe ve İngilizce Versiyonlarıyla) ",
    "description": "Wordle oyununun bir kopyası. Orijinal oyunun tüm mekaniklerini içerir. Bu oyunun iki versiyonunu geliştirdim. İngilizce versiyonu orijinal oyun gibi geliştirildi ve Türkçe versiyonuna zorluk seviyesini seçme seçeneği gibi ekstra mekanikler ekledim. Javascript, Html, Css ile geliştirildi.",
    "gitLink": "https://github.com/cemozr/wordle-clone-turkish",
    "appLink": "",
    "imageSrc": "",
    "usedSkills": ["Javascript", "Html", "Css"]
  },
  {
    "name": "Mesh Renderer ",
    "description": "Xml'den okunan 3D mesh'i 2D yüzeye yansıtıp ekrana çizen uygulama. Ayrıca kullanıcılar çizilen nesneyi 360 derece döndürebilir. Javascript, Xml, Html Canvas, Css ile geliştirildi.",
    "gitLink": "https://github.com/cemozr/Mesh-Renderer",
    "appLink": "",
    "imageSrc": "",
    "usedSkills": ["Javascript", "Xml", "Html", "Canvas", "Css"]
  },
  {
    "name": "Hesap Makinesi Uygulaması",
    "description": "Temel aritmetik işlemleri içeren basit bir hesap makinesi. Tüm akıllı cihazlarda çalışacak şekilde responsive tasarıma sahiptir. React, Context Api, Javascript, Css, Html ile geliştirildi.",
    "gitLink": "https://github.com/cemozr/react-calculator",
    "appLink": "",
    "imageSrc": "",
    "usedSkills": ["React", "Context Api", "Javascript", "Css", "Html"]
  },
  {
    "name": "Yapılacaklar Listesi Uygulaması",
    "description": "Kullanıcıların günlük rutinlerini düzenlemek için görevler oluşturabilecekleri, düzenleyebilecekleri, silebilecekleri ve görüntüleyebilecekleri bir React uygulaması. React, Context Api, Json-server, Axios, Javascript, Css, Html ile geliştirildi.",
    "gitLink": "https://github.com/cemozr/React-to-do-app",
    "appLink": "",
    "imageSrc": "",
    "usedSkills": [
      "React",
      "Context Api",
      "Json-server",
      "Axios",
      "Javascript",
      "Css",
      "Html"
    ]
  },
  {
    "name": "2D Top Down Shoot’em Up Türünde Oyun  ",
    "description": "C#, Unity oyun motoru ve ücretsiz görsel, işitsel kaynaklar kullanılarak yapılmış bir bilgisayar oyunu. ",
    "gitLink": "https://github.com/cemozr/Unity-2D-Shoot-Em-Up-Game",
    "appLink": "",
    "imageSrc": "",
    "usedSkills": ["C#", "Unity"]
  },
  {
    "name": "Fotoğraf Üretici",
    "description": "Bu uygulama, kullanıcı tarafından sağlanan ilgili anahtar kelimeler aracılığıyla Unsplash Api'den görseller döndürür. React, Axios, Javascript, Css, Html ile geliştirildi.",
    "gitLink": "https://github.com/cemozr/weather-app",
    "appLink": "",
    "imageSrc": "",
    "usedSkills": [" React", "Axios", "Javascript", "Css", "Html"]
  }
]
